Autodesk.Revit.DB.ProjectPosition.Angle
Angle from True North
Remarks: This is the angle difference between project north and true north measured in radians. It can have a value from -PI to +PI.

Autodesk.Revit.DB.ProjectPosition.Elevation
Elevation above ground level.
Remarks: Measured in decimal feet.

Autodesk.Revit.DB.ProjectPosition.NorthSouth
North/South offset
Remarks: The offset of the project location from the site location in the north/south direction.
Measured in decimal feet.

Autodesk.Revit.DB.ProjectPosition.EastWest
East/West offset
Remarks: The offset of the project location from the site location in the east/west direction.
Measured in decimal feet.

Autodesk.Revit.DB.ProjectPosition.#ctor(System.Double,System.Double,System.Double,System.Double)
Construct a new ProjectPosition object with the specified East/West offset,
North/South offset, elevation offset and angle of rotation
ew: East/West offset
ns: North/South offset
elevation: Elevation offset
angle: Rotation from true north, in radians.
Remarks: The angle can be in the range of +PI to -PI

Autodesk.Revit.DB.ProjectPosition
An object that is used to represent a geographical offset and rotation.